blogs/DRY请用——Python描述器.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbdcbbfd">1. non-data和data descriptors</a></li>
<li><a href="#org4a846b4">2. cached<sub>property</sub></a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbdcbbfd" class="outline-2">
<h2 id="orgbdcbbfd"><span class="section-number-2">1</span> non-data和data descriptors</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">property2</span><span style="color: #8c8c8c;">(</span><span style="color: #d08770;">object</span><span style="color: #8c8c8c;">)</span>:

    <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">__init__</span><span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span>, fget<span style="color: #8c8c8c;">)</span>:
        <span style="color: #b48ead;">self</span>.fget = fget

    <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">__get__</span><span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span>, ins, owner<span style="color: #8c8c8c;">)</span>:
        <span style="color: #b48ead;">return</span> <span style="color: #b48ead;">self</span>.fget<span style="color: #8c8c8c;">(</span>ins<span style="color: #8c8c8c;">)</span>

    <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">__set__</span><span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span>, ins, value<span style="color: #8c8c8c;">)</span>:
        <span style="color: #b48ead;">self</span>.ins = value

<span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">K</span><span style="color: #8c8c8c;">(</span><span style="color: #d08770;">object</span><span style="color: #8c8c8c;">)</span>:

    <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">value</span><span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">)</span>:
        <span style="color: #b48ead;">return</span> <span style="color: #a3be8c;">'shiiiiit'</span>

    <span style="color: #bf616a;">value</span> = property2<span style="color: #8c8c8c;">(</span>value<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">property2</span><span style="color: #8c8c8c;">(</span><span style="color: #d08770;">object</span><span style="color: #8c8c8c;">)</span>:

    <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">__init__</span><span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span>, fget<span style="color: #8c8c8c;">)</span>:
        <span style="color: #b48ead;">self</span>.fget = fget

    <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">__get__</span><span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span>, ins, owner<span style="color: #8c8c8c;">)</span>:
        <span style="color: #b48ead;">return</span> <span style="color: #b48ead;">self</span>.fget<span style="color: #8c8c8c;">(</span>ins<span style="color: #8c8c8c;">)</span>

<span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">K</span><span style="color: #8c8c8c;">(</span><span style="color: #d08770;">object</span><span style="color: #8c8c8c;">)</span>:

    <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">value</span><span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span><span style="color: #8c8c8c;">)</span>:
        <span style="color: #b48ead;">return</span> <span style="color: #a3be8c;">'shiiiiit'</span>

    <span style="color: #bf616a;">value</span> = property2<span style="color: #8c8c8c;">(</span>value<span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org4a846b4" class="outline-2">
<h2 id="org4a846b4"><span class="section-number-2">2</span> cached<sub>property</sub></h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">cached_property</span><span style="color: #8c8c8c;">(</span><span style="color: #d08770;">object</span><span style="color: #8c8c8c;">)</span>:
    <span style="color: #a3be8c;">"""Copied from Django.</span>
<span style="color: #a3be8c;">    Decorator that converts a method with a single self argument into a</span>
<span style="color: #a3be8c;">    property cached on the instance.</span>
<span style="color: #a3be8c;">    Optional ``name`` argument allows you to make cached properties of other</span>
<span style="color: #a3be8c;">    methods. (e.g.  url = cached_property(get_absolute_url, name='url') )</span>
<span style="color: #a3be8c;">    """</span>

    <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">__init__</span><span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span>, func, name=<span style="color: #d08770;">None</span><span style="color: #8c8c8c;">)</span>:
        <span style="color: #b48ead;">self</span>.func = func
        <span style="color: #b48ead;">self</span>.<span style="color: #d08770;">__doc__</span> = <span style="color: #d08770;">getattr</span><span style="color: #8c8c8c;">(</span>func, <span style="color: #a3be8c;">'__doc__'</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #b48ead;">self</span>.name = name <span style="color: #b48ead;">or</span> func.<span style="color: #d08770;">__name__</span>

    <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">__get__</span><span style="color: #8c8c8c;">(</span><span style="color: #b48ead;">self</span>, instance, <span style="color: #d08770;">type</span>=<span style="color: #d08770;">None</span><span style="color: #8c8c8c;">)</span>:
        <span style="color: #b48ead;">if</span> instance <span style="color: #b48ead;">is</span> <span style="color: #d08770;">None</span>:
            <span style="color: #b48ead;">return</span> <span style="color: #b48ead;">self</span>
        <span style="color: #bf616a;">res</span> = <span style="color: #bf616a;">instance.__dict__</span><span style="color: #8c8c8c;">[</span><span style="color: #b48ead;">self</span>.name<span style="color: #8c8c8c;">]</span> = <span style="color: #b48ead;">self</span>.func<span style="color: #8c8c8c;">(</span>instance<span style="color: #8c8c8c;">)</span>
        <span style="color: #b48ead;">return</span> res

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.1.13)</p>
</div>
</div>
</body>
</html>
